{
    "home": "Home",
    "about": "About",
    "services": "Services",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "turning": "Turning",
    "visions": "visions",
    "into_virtual": "into virtual",
    "reality": "reality",
    "professional": "Professional",
    "web_development": "Web Development",
    "web_information_service": "Create fast, responsive, and user-friendly websites using cutting-edge technologies to elevate your online presence.",
    "custom": "Custom",
    "ecommerce_solutions": "E-commerce Solutions",
    "ecommerce_service": "Build scalable online stores with seamless payment integrations and advanced features to boost your sales and customer engagement.",
    "innovative": "Innovative",
    "ui/ux_design": "UI/UX Design",
    "design_service": "Deliver exceptional user experiences with visually stunning designs crafted using Figma, Adobe XD, and intuitive prototyping tools.",
    "reliable": "Reliable",
    "website_maintenance": "Website Maintenance",
    "website_maintenance_service": "Keep your website secure, up-to-date, and optimized for peak performance with our dedicated maintenance and support services.",
    "customized_web_solutions": "Customized Web Solutions",
    "customized_web_solutions_service1": "Transform your ideas into stunning, functional websites that achieve measurable results. From concept to completion, I deliver customized solutions that align with your goals.",
    "customized_web_solutions_service2": "Contact me for exceptional service that brings your ideas to life and takes your online presence to the next level.",
    "schedule_a_meeting_with_me": "Schedule a meeting with me",
    "about_me": "About Me",
    "about_me_information_1": "Hello, I’m Katrina, a passionate and experienced web developer with over six years of expertise in crafting seamless and user-focused applications. I specialize in building robust backend systems with .NET and creating dynamic frontend experiences using React and Angular.",
    "about_me_information_2": "I’m committed to turning innovative ideas into functional, modern solutions that provide real value to businesses. My approach is methodical, focused, and collaborative—ensuring that every project delivers a superior user experience.",
    "about_me_information_3": "Let’s create something innovative together! I’m always excited to work with clients who value quality and cutting-edge technology.",
    "licensed_content": "Licensed Content",
    "wip_information": "We're working on this page! Stay tuned!",
    "lets_build_something_great": "Let's Build Something Great",
    "modal_description": "Thanks for visiting! I’m a dedicated solo developer ready to bring your ideas to life. If you have a project in mind, fill out the form below, and I’ll get back to you soon. Let’s make something great together!",
    "firstname": "First name",
    "lastname": "Last name",
    "email": "Email",
    "subject": "Subject",
    "message": "Message",
    "cancel": "Cancel",
    "send": "Send",
    "error_firstname": "First Name must be at least 2 characters long.",
    "error_lastname": "Last Name must be at least 2 characters long.",
    "error_email_required": "Email is required.",
    "error_email_invalid": "Please enter a valid email address.",
    "error_subject": "Subject must be at least 5 characters long.",
    "error_message": "Message must be at least 10 characters long.",
    "placeholder_firstname": "Enter your first name",
    "placeholder_lastname": "Enter your last name",
    "placeholder_email": "Email address",
    "placeholder_subject": "Subject",
    "placeholder_message": "Write your message",
    "service_title": "Create Your Dream Website with an Experienced Developer",
    "web_dev_desc": "We create professional, modern, and custom websites to help your business grow online.",
    "web_dev_details": [
    "✅ Tailor-made solutions for your business",
    "✅ SEO-optimized and high performance",
    "✅ Mobile-friendly and easy to maintain"
    ],
    "service_intro": [
    "Professional web services for your business?",
    "Looking for a developer who can bring your vision to life and take your digital presence to the next level?",
    "Whether you need a brand new website, a custom e-commerce solution, or a seamless user experience, I'm here to help."
    ],
    "services_we_offer":"Here are some of the services I offer:",
    "ecommerce_desc": "We build powerful and user-friendly e-commerce solutions tailored to your needs.",
    "ecommerce_details": [
        "🛒 Custom online stores",
        "🔒 Secure payment solutions",
        "📈 SEO-optimized for better visibility"
    ],
    "uiux_desc": "A beautiful and user-friendly design is crucial for a positive experience.",
    "uiux_details": [
    "🎨 Attractive and modern design",
    "🧭 Easy navigation",
    "📊 Optimized for conversions"
    ],
    "maintenance_desc": "Having a website is just the beginning – it needs to be updated and secure.",
    "maintenance_details": [
        "🔄 Regular updates",
        "📂 Backup and restoration",
        "⚡ Optimization for faster load times"
    ],
    "workflow_title": "Our Workflow",
    "steps": {
        "contact": {
            "title": "First contact",
            "description": [
                "We schedule a meeting together.",
                "In this initial step, we establish a connection and set up a discovery call to understand your requirements, goals, and expectations.",
                "We discuss your business, target audience, and what you hope to achieve with the website."
            ]
        },
        "consultation": {
            "title": "Initial Consultation",
            "description": [
                "We discuss your needs and vision.",
                "During this phase, we go in-depth about your project requirements, design preferences, and any specific features you want.",
                "We explore your brand identity, competitors, and industry trends to ensure your website stands out."
            ]
        },
        "planning": {
            "title": "Planning",
            "description": [
                "We create a detailed plan and timeline.",
                "A project roadmap is developed, including deliverables, milestones, and deadlines.",
                "We define the site’s structure, user experience (UX) strategy, and technical specifications.",
                "A sitemap and wireframes may be created to outline the layout and flow of the website."
            ]
        },
        "design": {
            "title": "Design",
            "description": [
                "We design a prototype for your feedback.",
                "We create high-fidelity mockups or interactive prototypes to visualize the website's look and feel.",
                "Color schemes, typography, and UI elements are carefully chosen to align with your brand.",
                "You provide feedback, and we make revisions as needed before proceeding."
            ]
        },
        "development": {
            "title": "Development",
            "description": [
                "We build the website based on the approved design.",
                "Frontend and backend development take place, turning designs into a fully functional website.",
                "Features like animations, forms, databases, and integrations (e.g., payment gateways, APIs) are implemented.",
                "The website is built to be mobile-friendly, fast-loading, and SEO-optimized."
            ]
        },
        "testing": {
            "title": "Testing",
            "description": [
                "We thoroughly test the website.",
                "Comprehensive testing is conducted, including functionality, responsiveness, cross-browser compatibility, and security checks.",
                "Bugs and performance issues are identified and resolved to ensure a seamless user experience.",
                "We conduct user testing and collect feedback for final adjustments."
            ]
        },
        "launch": {
            "title": "Launch",
            "description": [
                "We launch the website and ensure everything works.",
                "The website is deployed to a live server, making it accessible to users.",
                "Final performance checks, speed optimizations, and security reinforcements are performed.",
                "We monitor the launch closely to ensure a smooth transition."
            ]
        },
        "maintenance": {
            "title": "Maintenance",
            "description": [
                "We provide ongoing support and maintenance.",
                "Regular updates, security patches, and backups are performed to keep the website running smoothly.",
                "We offer continued support for bug fixes, content updates, and feature enhancements.",
                "Analytics and performance reviews help optimize the site over time."
            ]
        }
    },
    "why_choose_us": "Why Choose Us?",
    "what_we_offer": "What We Offer:",
    "design_principles": "Our Design Principles:",
    "maintenance_includes": "What's Included:",
    "professional_web_development": "Professional Web Development",
    "custom_ecommerce_solutions": "Custom E-commerce Solutions",
    "innovative_uiux_design": "Innovative UI/UX Design",
    "reliable_website_maintenance": "Reliable Website Maintenance"
}