{
    "home": "Home",
    "about": "About",
    "services": "Services",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "turning": "Turning",
    "visions": "visions",
    "into_virtual": "into virtual",
    "reality": "reality",
    "professional": "Professional",
    "web_development": "Web Development",
    "web_information_service": "Create fast, responsive, and user-friendly websites using cutting-edge technologies to elevate your online presence.",
    "custom": "Custom",
    "ecommerce_solutions": "E-commerce Solutions",
    "ecommerce_service": "Build scalable online stores with seamless payment integrations and advanced features to boost your sales and customer engagement.",
    "innovative": "Innovative",
    "ui/ux_design": "UI/UX Design",
    "design_service": "Deliver exceptional user experiences with visually stunning designs crafted using Figma, Adobe XD, and intuitive prototyping tools.",
    "reliable": "Reliable",
    "website_maintenance": "Website Maintenance",
    "website_maintenance_service": "Keep your website secure, up-to-date, and optimized for peak performance with our dedicated maintenance and support services.",
    "customized_web_solutions": "Customized Web Solutions",
    "customized_web_solutions_service1": "Transform your ideas into stunning, functional websites that achieve measurable results. From concept to completion, I deliver customized solutions that align with your goals.",
    "customized_web_solutions_service2": "Contact me for exceptional service that brings your ideas to life and takes your online presence to the next level.",
    "schedule_a_meeting_with_me": "Schedule a meeting with me",
    "about_me": "About Me",
    "about_me_information_1": "Hello, I’m Katrina, a passionate and experienced web developer with over six years of expertise in crafting seamless and user-focused applications. I specialize in building robust backend systems with .NET and creating dynamic frontend experiences using React and Angular.",
    "about_me_information_2": "I’m committed to turning innovative ideas into functional, modern solutions that provide real value to businesses. My approach is methodical, focused, and collaborative—ensuring that every project delivers a superior user experience.",
    "about_me_information_3": "Let’s create something innovative together! I’m always excited to work with clients who value quality and cutting-edge technology.",
    "licensed_content": "Licensed Content",
    "wip_information": "We're working on this page! Stay tuned!",
    "lets_build_something_great": "Let's Build Something Great",
    "modal_description": "Thanks for visiting! I’m a dedicated solo developer ready to bring your ideas to life. If you have a project in mind, fill out the form below, and I’ll get back to you soon. Let’s make something great together!",
    "firstname": "First name",
    "lastname": "Last name",
    "email": "Email",
    "subject": "Subject",
    "message": "Message",
    "cancel": "Cancel",
    "send": "Send",
    "error_firstname": "First Name must be at least 2 characters long.",
    "error_lastname": "Last Name must be at least 2 characters long.",
    "error_email_required": "Email is required.",
    "error_email_invalid": "Please enter a valid email address.",
    "error_subject": "Subject must be at least 5 characters long.",
    "error_message": "Message must be at least 10 characters long.",
    "placeholder_firstname": "Enter your first name",
    "placeholder_lastname": "Enter your last name",
    "placeholder_email": "Email address",
    "placeholder_subject": "Subject",
    "placeholder_message": "Write your message"
}